a = input('Здравствуйте! Как Вас зовут? ')
print('Очень приятно, ', a, '! Меня зовут Марк.', sep="")
b = int(input('Сколько Вам лет? '))
if b>78 and (b-78==11 or b-78==12 or b-78==13 or b-78==14):
    print(f'Да, {a}, Вы старше меня на {b-78} лет.')
elif b>78 and (b-78)%10>4:
    print(f'Да, {a}, Вы старше меня на {b-78} лет.')
elif b>78 and 2<=(b-78)%10<=4:
    print(f'Да, {a}, Вы старше меня на {b - 78} года.')
elif b>78 and (b-78)%10 ==1:
    print(f'Да, {a}, Вы старше меня на {b - 78} год.')
elif b<78 and (78-b ==11 or 78-b==12 or 78-b==13 or 78-b==14):
    print(f'Да, {a}, Вы старше меня на {78-b} лет.')
elif b<78 and (78-b)%10 ==1:
    print(f'Да, {a}, я старше вас на {78-b} год.')
elif b<78 and 2<=(78-b)%10<=4:
    print(f'Да, {a}, я старше вас на {78-b} года.')
elif b<78 and (78-b)%10>4:
    print(f'Да, {a}, я старше вас на {78-b} лет.')
else: print(f'Да, {a}, мы с вами ровестники.')
c = input('Вам нравится программировать? ')
if c == 'да':
    print(
        'Превосходно! Уверен, у Вас получится'
        ' написать множество полезных и хороших программ.'
    )
elif c == 'нет':
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')
else: print('**Звуки сверчков**')


#78