a = input('Собака короткошерстной породы? ')
if a == 'да':
    b = input('Рост собаки меньше 50см? ')
    if b == 'да':
        c = input('У собаки короткий хвост? ')
        if c == 'да':
            print('Английский бульдог')
        elif c == 'нет':
            d = input('У собаки длинные уши? ')
            if d == 'да':
                print('Гончая')
            elif d == 'нет':
                e = input('У собаки короткое тело? ')
                if e == 'да':
                    print('Мопс')
                elif e == 'нет':
                    print('Чихуахуа')
    elif b == 'нет':
        c = input('Собака весит более 50кг? ')
        if c == 'да':
            print('Датский дог')
        elif c == 'нет':
            print('Фоксхаунд')
elif a == 'нет':
    b = input('Рост собаки меньше 50см? ')
    if b == 'да':
        c = input('У собаки доброжелательный характер? ')
        if c == 'да':
            print('Кокер-спаниэль')
        elif c == 'нет':
            print('Ирландский сеттер')
    elif b == 'нет':
        c = input('У собаки рост менее 70см? ')
        if c == 'да':
            d = input('У собаки длинные уши? ')
            if d == 'да':
                print('Большой вандейский грифон')
            elif d == 'нет':
                print('Колли')
        elif c == 'нет':
            d = input('Окрас рыжий с белыми отметинами? ')
            if d == 'да':
                print('Сенбернар')
            elif d == 'нет':
                e = input('Белоснежный окрас? ')
                if e == 'да':
                    print('Ирландский волкодав')
                elif e == 'нет':
                    print('Ньюфаундленд')





